[
	{
		"id": 1,
		"courseName": "Javascript",
		"courseImg": "https://i.imgur.com/6xrqbvr.jpg",
		"courseDuration": 90,
		"courseTitle": "What is JavaScript ?",
		"courseDetails": "JavaScript is a dynamic computer programming language. It is lightweight and most commonly used as a part of web pages, whose implementations allow client-side script to interact with the user and make dynamic pages. It is an interpreted programming language with object-oriented capabilities. JavaScript was first known as LiveScript, but Netscape changed its name to JavaScript, possibly because of the excitement being generated by Java. JavaScript made its first appearance in Netscape 2.0 in 1995 with the name LiveScript. The general-purpose core of the language has been embedded in Netscape,Internet Explorer, and other web browsers.",
		"courseWriter": "Johnson",
		"writerThumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQg5HciOJvQxGScF0V2TUJKyxd2q5jMZ3M7ZY9337KeB4hlRSqzc2VSxOlVj_KBgJRfcWA&usqp=CAU",
		"courseFee": 2200
	},
	{
		"id": 2,
		"courseName": "CSS",
		"courseTitle": "What Is CSS and How Does It Work?",
		"courseImg": "https://miro.medium.com/max/1400/1*H0IBb9kvGI3eIuL1sGmWug.jpeg",
		"courseDuration": 20,
		"courseDetails": "CSS was developed by W3C (World Wide Web Consortium) in 1996 for a rather simple reason. HTML element was not designed to have tags that would help format the page. You were only supposed to write the markup for the web page. Tags like <font> were introduced in HTML version 3.2, and it caused quite a lot of trouble for web developers. Due to the fact that web pages have different fonts, colored backgrounds, and multiple styles, it was a long, painful, and expensive process to rewrite the code. Thus, CSS was created by W3C to solve this problem. CSS is not technically a necessity, but you probably wouldn’t want to look at a web page that features only HTML elements as it would look completely bare-boned.",
		"courseWriter": "Meteron Perlo",
		"writerThumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTCi_CSMB7sDctiMJ1By2i-mQuCrRFPt0uPO0l6RpY4QSYUQSwWMLtYg8XL0_wsH5dX9CA&usqp=CAU",
		"courseFee": 1200
	},
	{
		"id": 3,
		"courseName": "GO",
		"courseTitle": "What is Go (programming language)?",
		"courseImg": "https://miro.medium.com/proxy/0*c9YMaQmmoGRrFnKP",
		"courseDuration": 120,
		"courseDetails": "Go (also called Golang or Go language) is an open source programming language used for general purpose. Go was developed by Google engineers to create dependable and efficient software. Most similarly modeled after C, Go is statically typed and explicit. The language was designed by taking inspiration for the productivity and relative simplicity of Python, with the ability of C. Some of the problems that Go addresses are slow build time, uncontrolled dependencies, effort duplication, difficulty of writing automatic tools and cross-language development. Go works by using or lightweight processes, which allows further efficiencies. Go also uses a collection of packages for efficient dependency management. Some examples of organizations that use Go include Google, Cloudflare, Dropbox, MongoDB, Netflix, SoundCloud, Twitch and Uber.",
		"courseWriter": "Donald pwets",
		"writerThumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ19gukjMEP514rtMTSm9a07SmpcNNASmLk9vzm1HyXGp1DojKgXgZSossyG7_pu7g-ZD8&usqp=CAU",
		"courseFee": 5200
	},
	{
		"id": 4,
		"courseName": "PHP",
		"courseTitle": "What Is PHP?",
		"courseImg": "https://upload.wikimedia.org/wikipedia/commons/c/c1/PHP_Logo.png",
		"courseDuration": 180,
		"courseDetails": "What Is PHP? Learning All About the Scripting Language What Is PHP? Learning All About the Scripting Language Hypertext Preprocessor (PHP) is an open-source, free server-side scripting language widely used in web development. According to Web Technology Surveys, PHP is used by 78.1% of all websites, including high-traffic websites like Facebook and Wikipedia. Anyone can benefit from learning about PHP, but it is even more essential for those interested in web programming. PHP is available on all major operating systems, such as Linux, Microsoft Windows, and macOS. Most web servers, including Apache and IIS, also support PHP. One of the main benefits of using PHP is advancing the customization of a WordPress site. Other features include great online support and documentation, so even beginners can learn PHP quickly. This article will go over the basics of PHP. By the end of it, you will understand the full benefits of PHP and how to utilize it in WordPress.",
		"courseWriter": "Shamslu Quart",
		"writerThumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTBwXDlQkmz0KIMpY9X2NjwTwpMjJXowPxXEw&usqp=CAU",
		"courseFee": 3600
	},
	{
		"id": 5,
		"courseName": "Python",
		"courseTitle": "What is Python?",
		"courseImg": "https://www.filepicker.io/api/file/BFMMlbcQvml9HSqXcvNp",
		"courseDuration": 260,
		"courseDetails": "Python is an interpreted, object-oriented, high-level programming language with dynamic semantics. Its high-level built in data structures, combined with dynamic typing and dynamic binding, make it very attractive for Rapid Application Development, as well as for use as a scripting or glue language to connect existing components together. Python's simple, easy to learn syntax emphasizes readability and therefore reduces the cost of program maintenance. Python supports modules and packages, which encourages program modularity and code reuse. The Python interpreter and the extensive standard library are available in source or binary form without charge for all major platforms, and can be freely distributed.Often, programmers fall in love with Python because of the increased productivity it provides. Since there is no compilation step, the edit-test-debug cycle is incredibly fast. Debugging Python programs is easy: a bug or bad input will never cause a segmentation fault. Instead, when the interpreter discovers an error, it raises an exception. When the program doesn't catch the exception, the interpreter prints a stack trace. A source level debugger allows inspection of local and global variables, evaluation of arbitrary expressions, setting breakpoints, stepping through the code a line at a time, and so on. The debugger is written in Python itself, testifying to Python's introspective power. On the other hand, often the quickest way to debug a program is to add a few print statements to the source: the fast edit-test-debug cycle makes this simple approach very effective.",
		"courseWriter": "Tania Rascia",
		"writerThumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQWrXjqEt9s33oC7lVtzAFfc6zlXU2xOqiGtA&usqp=CAU",
		"courseFee": 8200
	},
	{
		"id": 6,
		"courseName": "HTML",
		"courseTitle": "What Is HTML?",
		"courseImg": "https://c4.wallpaperflare.com/wallpaper/408/322/548/html5-hypertext-markup-language-logo-html-5-illustration-wallpaper-preview.jpg",
		"courseDuration": 20,
		"courseDetails": "Hypertext Markup Language Basics Explained What Is HTML? Hypertext Markup Language Basics Explained HTML stands for HyperText Markup Language. It is a standard markup language for web page creation. It allows the creation and structure of sections, paragraphs, and links using HTML elements (the building blocks of a web page) such as tags and attributes. HTML has a lot of use cases, namely: Web development.Developers use HTML code to design how a browser displays web page elements, such as text, hyperlinks, and media files. Internet navigation. Users can easily navigate and insert links between related pages and websites as HTML is heavily used to embed hyperlinks. Web documentation. HTML makes it possible to organize and format documents, similarly to Microsoft Word. It’s also worth noting that HTML is not considered a programming language as it can’t create dynamic functionality. It is now considered an official web standard. The World Wide Web Consortium (W3C) maintains and develops HTML specifications, along with providing regular updates. This article will go over the basics of HTML, including how it works, its pros and cons, and how it relates to CSS and JavaScript.",
		"courseWriter": "Arjun Ketro",
		"writerThumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ7peosIK7f9QW2PW7FLhhS9nuxN5htP3cSqg&usqp=CAU",
		"courseFee": 1900
	}
]
